gatling/resources/data/Soap_request_GetPersonByName.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.wizards.com/Service/2013-03">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:GetPersonByName>
         <ns:request>
            <ns:AuthToken>${access_token}</ns:AuthToken>
            <ns:CountryCode>US</ns:CountryCode>
            <ns:FirstName>Test</ns:FirstName>
            <ns:LastName>Account</ns:LastName>
         </ns:request>
      </ns:GetPersonByName>
   </soapenv:Body>
</soapenv:Envelope>
